{
    "dialogue": {
        "1": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "Ah, there you are. Please, take a seat."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "2"
        },
        "2": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "",
            "nameplate": "",
            "animation": "",
            "text": [
                "They gesture to one of the larger, rectangular tables. You've no choice but to sit.",
                "Jimmy soon follows, noticably less tense than before. You’re still not sure what to expect out of all of this.",
                "Thaliak places the device in the center of the surface and gently presses it. It flashes in a burst of three, before an outer ring glows a steady red.",
                "Jimmy fiddles with some tablet."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "3"
        },
        "3": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "Investigator Thaliak, beginning interrogation.",
                "Yea, yea, I know.",
                "\"Interrogation\" is a word with some negative connotations.",
                "I understand you're confused, so let me explain the situation, yea?"
            ],
            "links": [],
            "linktext": {},
            "quietLink": "4"
        },
        "4": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "",
            "animation": "",
            "text": [
                "You shift yourself to get more comfortable. You don't generally get abducted by aliens without something big going on, presumably.",
                "Thaliak takes your shifting as you being ready."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "5"
        },
        "5": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "I am an investigator acting on behalf of the Galactic Federated Union, as is everyone on this ship.",
                "As for what we're investigating, Earth has recently, at least in our perspective, been a point of contention.",
                "Long story short, Earth is emitting a lot of radio waves, astronomers can't see anything in a 120 lightyear radius around Earth...",
                "...and because of Earth's history and past research on the planet, enough people are opposed to integrating human society into the union.",
                "Such a tough position means we were sent to find someone who can act as a middleman between the Union and Earth.",
                "And before you ask,",
                "No, we couldn't take anyone like engineers, too high profile, we figure taking someone proficient in the field would alert Earth of our presense.",
                "There's way too many anti-alien media and predispositions for that to be a good thing."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "6"
        },
        "6": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "So, any questions before we continue?"
            ],
            "links": [
                "7a",
                "7b",
                "7c",
                "8"
            ],
            "linktext": {
                "7a": "There are people doing research on Earth?",
                "7b": "Why me, specifically?",
                "7c": "Radio waves?",
                "8": "No."
            },
            "quietLink": ""
        },
        "7a": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "Earth has been designated a natural sanctuary around the time the Union came to be.",
                "At the time, humans were noticed to be on the path to progress into civilization, which just solidified Earth as a sanctuary planet.",
                "On top of the diverse biomes and ecosystems, there was now a race of people achieving sentience.",
                "In fact, based on information from several dozen civilizations, some still kicking, some not, some people figured they could nudge humanity in a way that would make it easy to join the Union.",
                "Then, when humanity was ready, we'd reveal our existence and give technology to be productive members of the Union.",
                "We stopped.",
                "The state of the dominant nations has deemed humanity too volatile to tamper with.",
                "Nowadays, people do passive research on Earth.",
                "There's still hope for your world. Maybe you'll oversee it becoming accepted in the galactic community."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "6"
        },
        "7b": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "As mentioned, you aren't a politician or an engineer.",
                "Obviously, you'd be a bit more qualified to deal with this problem but, also, as mentioned, someone that high profile disappearing is too much of a risk.",
                "We figured that a low-profile civilian would still be proficient enough to at least start the process of remediating this problem.",
                "You probably don't agree but I think you're lucky.",
                "We'd unfortunately interrogated some far less savory people. We almost lost Jimmy to one of them. Supposedly they thought radio waves gave frogs cancer or something equally asinine."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "6"
        },
        "7c": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "As you're well aware, radio waves are a form of electromagnetic radiation. Almost every living being relies on some band of frequencies to live.",
                "As is expected, your civilization developed means to communicate via this radiation so humans have been shooting radiation into space for a while.",
                "We thought you would reduce polluting the space around your star as technology develops, but it seems it's only been getting worse.",
                "The reason this matters is that the Department of Internal Astronomy relies on radio waves to do its work, which means around Earth is a giant blind spot that only gets bigger and stronger."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "6"
        },
        "8": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "So, now that you know what's at stake, it is time for us to confirm your readiness to take up the position as Earth's first ambassador, or whatever they decide to call it.",
                "Yes, the job sounds scary, but we can work out your responsibilities and benefits once we deem you fit for the job.",
                "No, we're not gonna quote unquote \"dispose\" you if you don't fit the criteria, we'll just wipe your memory and send you back home like nothing happened.",
                "Look, we know you got friends and family, but you'll see them again, we're gonna let them know that you'll be away for a while, and you'll have a job in government, so there really isn't a good reason to say no, yea?",
                "I know this is a lot to take in, so I'll give you a second.",
                "Let me know when you're good to go."
            ],
            "links": [],
            "linktext": {},
            "quietLink": ""
        },
        "interrogation1": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "So, we do need to confirm you know enough to actually get things done.",
                "It wouldn't really help if someone responsible for reducing radio pollution thought radio waves fry brains, would we?",
                "Alrighty then, let's start with something easy."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation2"
        },
        "interrogation2": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "About when was radio communication invented?"
            ],
            "links": [
                "interrogation3a",
                "interrogation3b",
                "interrogation3c"
            ],
            "linktext": {
                "interrogation3a": "About 120 years ago.",
                "interrogation3b": "Uh, a while ago.",
                "interrogation3c": "1890"
            },
            "quietLink": ""
        },
        "interrogation3a": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "More or less, yea."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation4"
        },
        "interrogation3b": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "Well, humans seldom live past 100 years, so yea, that's technically right."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation4"
        },
        "interrogation3c": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "Well, that's debatable, but it was definitely the decade this was being developed."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation4"
        },
        "interrogation4": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "Dates aren't really important, but I just wanted to make sure you were aware of basic stuff.",
                "Now then, how are radio waves used by humans?"
            ],
            "links": [
                "interrogation5a",
                "interrogation5b",
                "interrogation5c"
            ],
            "linktext": {
                "interrogation5a": "Uh, a lot of things.",
                "interrogation5b": "Communication, astronomy, sometimes even medicine.",
                "interrogation5c": "Media stuff."
            },
            "quietLink": ""
        },
        "interrogation5a": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "I wouldn't want to bore you and the people poring this log by having you sit here and list out every single thing.",
                "At least it's clear you know how important it is in human cultures."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation6"
        },
        "interrogation5b": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "That covers most of it, really, you could probably argue all of it.",
                "Still some specificity to get into but I don't think either of us have the time to list it all out."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation6"
        },
        "interrogation5c": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "Radio, in some form or another, is fundamental for human communication, which is the basis of culture, no?",
                "Of course, there are others, but it's easy to take it for granted."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation6"
        },
        "interrogation6": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "So, then, the last of the important questions.",
                "Yes, I know, a bit short, but I can assure you that Union education is far better than what you can get planetside.",
                "We can fill in any gaps later.",
                "So, where do you think the future of long-range communication lies?"
            ],
            "links": [
                "interrogation7a",
                "interrogation7b",
                "interrogation7c"
            ],
            "linktext": {
                "interrogation7a": "Well, considering the state of the post-capitalist culture...",
                "interrogation7b": "Well, depends on the alternatives...",
                "interrogation7c": "Well..."
            },
            "quietLink": ""
        },
        "interrogation7a": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "",
            "animation": "",
            "text": [
                "You spend a good while discussing, eventually ranting about the stagnation of technology due to the emphasis on sellable products over useful, utilitarian, practical products.",
                "Thaliak looks at you, sighing as you continue on.",
                "He shrugs and simply gives a slight noise in agreement with everything you say."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation8"
        },
        "interrogation7b": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "",
            "animation": "",
            "text": [
                "You struggle to find alternatives, but Thaliak gives you hypothetical technologies such as some muon or whatnot-based communication that can pass through the Earth.",
                "It doesn't take you a while to come up with utopian examples that seems to intrigue Thaliak."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation8"
        },
        "interrogation7c": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "",
            "animation": "",
            "text": [
                "You sit there, not really able to think of what to say."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation7c2"
        },
        "interrogation7c2": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "It's difficult, if not impossible to predict the future of technology, that's understandable."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation8"
        },
        "interrogation8": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "Well then..."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation9"
        },
        "interrogation9": {
            "flags": [],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "",
            "animation": "",
            "text": [
                "Thaliak ponders to themself.",
                "They cross their arms.",
                "They sure are taking their sweet time."
            ],
            "links": [],
            "linktext": {},
            "quietLink": "interrogation10"
        },
        "interrogation10": {
            "flags": [
                "interrogated"
            ],
            "items": [],
            "itemsRemoved": [],
            "sprite": "thaliak",
            "nameplate": "Thaliak",
            "animation": "",
            "text": [
                "Alright, I think you're a good enough candidate as any.",
                "I'm impressed someone not actively in the field has a grasp on something like this.",
                "Now then, to make this official, we need you to get acquainted with some folks.",
                "This has already been a lot so I'll tell you what your responsibilities will be as we travel around.",
                "No, you don't have a choice, but really, you'll be paid a good amount and you'll be back before you even know it.",
                "Oh, and because I know humans love science-fiction, no, space travel doesn't take a billion years. It'll be quicker than a walk to the store.",
                "I know, it's crazy the amount of technology that can be made when dozens of space-faring societies band together.",
                "Now then, follow me to the bridge once you're ready.",
                "I'll let you have a minute to sit and gather yourself before we head to Sagittarius, I'm in desperate need of a coffee at the moment."
            ],
            "links": [],
            "linktext": {},
            "quietLink": ""
        }
    }
}